<a href="https://colab.research.google.com/github/KaanErdogdu/Bootcamp_Bolum_1/blob/master/Odev2_7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

1.)

In [62]:
df = pd.DataFrame(index=['A','B','C','D','E','F','G','Ğ','H','I'])
df['Kolon 1'] = [2,3,5,7,11,13,17,19,23,29]
df['Kolon 2'] = [0, 1, 1, 2, 3, 5, 8, 13, 21, 34]
df

   Kolon 1  Kolon 2
A        2        0
B        3        1
C        5        1
D        7        2
E       11        3
F       13        5
G       17        8
Ğ       19       13
H       23       21
I       29       34

2.)

In [63]:
from google.colab import files
uploaded = files.upload()

Saving train.csv to train (1).csv

In [64]:
pd.read_csv('train.csv')

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [65]:
fd = pd.read_csv('train.csv')
fd

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [66]:
fd.to_csv('my_output',index=False)
fd

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [67]:
fd[['Sex','Age']]

        Sex   Age
0      male  22.0
1    female  38.0
2    female  26.0
3    female  35.0
4      male  35.0
..      ...   ...
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

[891 rows x 2 columns]

In [68]:
byGender = fd[["Sex","Age"]].groupby('Sex')
byGender.mean().loc["female"]

Age    27.915709
Name: female, dtype: float64

In [69]:
byGender = fd[["Sex","Age"]].groupby('Sex')
byGender.mean().loc["male"]

Age    30.726645
Name: male, dtype: float64

3.)

3.)30 yaşından küçük tüm yolcuların kurtulma oranını

In [72]:
Total =fd["Survived"].count()
Total

891

In [73]:
bySurv = fd[fd['Age'] < 30].groupby('Survived')

Survive=bySurv["Name"].count().loc[1]
Survive

156

In [74]:
Survive/Total

0.1750841750841751

3.) 30 yaşın altındaki yolcu sayısı

In [75]:
grr=fd[['Sex','Survived']][fd['Age']<30]
under30T=grr.count().loc['Survived']
under30T

384

3.)*kutrulan* 30 yaşın altında olan kadın yolcuların sayısı

In [76]:
grr=fd[['Sex','Survived']][fd['Age']<30][fd['Survived']>0].groupby('Sex')
under30F=grr.count().loc["female"]
under30F

Survived    105
Name: female, dtype: int64

3.)*kutrulan* 30 yaşın altında olan erkek yolcuların sayısı

In [77]:
grr=fd[['Sex','Survived']][fd['Age']<30][fd['Survived']>0].groupby('Sex')
under30M=grr.count().loc["male"]
under30M

Survived    51
Name: male, dtype: int64

In [78]:
under30M/Total #30yaş altı erkeklerin hayatta kalma oranı

Survived    0.057239
Name: male, dtype: float64

In [79]:
under30F/Total #30yaş altı kadınların hayatta kalma oranı

Survived    0.117845
Name: female, dtype: float64

In [80]:
under30M/under30T #30yaş altı erkeklerin 30 yaş altı insanlar arasında hayatta kalma oranı

Survived    0.132812
Name: male, dtype: float64

In [81]:
under30F/under30T #30yaş altı kadınların 30 yaş altı insanlar arasında hayatta kalma oranı

Survived    0.273438
Name: female, dtype: float64